; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s2)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s0)
	(at package2 s0)
	(at package3 s0)
	(at package4 s1)
	(at package5 s0)
	(at package6 s1)
	(at package7 s1)
	(at package8 s1)
	(at package9 s0)
	(at package10 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 60)
	(= (time-to-drive s1 s0) 60)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 95)
	(= (time-to-drive s2 s0) 95)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 16)
	(= (time-to-drive s1 s2) 16)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s1)
	(at truck1 s0)
	(at truck2 s0)
	(at truck3 s1)
	(at truck4 s0)
	(at package1 s2)
	(at package2 s0)
	(at package3 s0)
	(at package4 s2)
	(at package5 s1)
	(at package6 s1)
	(at package7 s0)
	(at package8 s2)
	(at package9 s2)
	(at package10 s1)
	))

(:metric minimize (+ (* 1 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   goals met: 4 of 17
2. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 17
3. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   goals met: 5 of 17
4. (load-truck package10 truck3 s2)
   deleted: (at package10 s2)
   added: (in package10 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 17
5. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 0 to 176
   goals met: 6 of 17
6. (unload-truck package10 truck3 s1)
   deleted: (in package10 truck3)
   added: (at package10 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 7 of 17
7. (load-truck package4 truck3 s1)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 7 of 17
8. (load-truck package7 truck3 s1)
   deleted: (at package7 s1)
   added: (in package7 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 7 of 17
9. (load-truck package8 truck3 s1)
   deleted: (at package8 s1)
   added: (in package8 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 7 of 17
10. (drive-truck truck3 s1 s2 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 176 to 432
   goals met: 6 of 17
11. (unload-truck package4 truck3 s2)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 7 of 17
12. (unload-truck package8 truck3 s2)
   deleted: (in package8 truck3)
   added: (at package8 s2)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 8 of 17
13. (board-truck driver3 truck4 s1)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 7 of 17
14. (drive-truck truck3 s2 s0 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 432 to 1477
   goals met: 7 of 17
15. (unload-truck package7 truck3 s0)
   deleted: (in package7 truck3)
   added: (at package7 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 17
16. (load-truck package1 truck3 s0)
   deleted: (at package1 s0)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 8 of 17
17. (load-truck package5 truck3 s0)
   deleted: (at package5 s0)
   added: (in package5 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 8 of 17
18. (load-truck package9 truck3 s0)
   deleted: (at package9 s0)
   added: (in package9 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 8 of 17
19. (drive-truck truck3 s0 s2 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (fuel-used) from 1477 to 2997
   goals met: 8 of 17
20. (unload-truck package1 truck3 s2)
   deleted: (in package1 truck3)
   added: (at package1 s2)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 9 of 17
21. (unload-truck package9 truck3 s2)
   deleted: (in package9 truck3)
   added: (at package9 s2)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 10 of 17
22. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 2997 to 3173
   goals met: 11 of 17
23. (disembark-truck driver1 truck3 s1)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 11 of 17
24. (walk driver1 s1 p0-1)
   deleted: (at driver1 s1)
   added: (at driver1 p0-1)
   goals met: 11 of 17
25. (walk driver1 p0-1 s0)
   deleted: (at driver1 p0-1)
   added: (at driver1 s0)
   goals met: 12 of 17
26. (drive-truck truck4 s1 s0 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (fuel-used) from 3173 to 3773
   goals met: 13 of 17
27. (walk driver2 s2 p2-1)
   deleted: (at driver2 s2)
   added: (at driver2 p2-1)
   goals met: 12 of 17
28. (walk driver2 p2-1 s1)
   deleted: (at driver2 p2-1)
   added: (at driver2 s1)
   goals met: 12 of 17
29. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 12 of 17
30. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 3773 to 4373
   goals met: 13 of 17
31. (drive-truck truck4 s0 s2 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (fuel-used) from 4373 to 5323
   goals met: 12 of 17
32. (drive-truck truck1 s0 s2 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 5323 to 6273
   goals met: 11 of 17
33. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 12 of 17
34. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 11 of 17
35. (disembark-truck driver3 truck4 s2)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 11 of 17
36. (drive-truck truck2 s2 s0 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 6273 to 7223
   goals met: 12 of 17
37. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 12 of 17
38. (drive-truck truck1 s2 s1 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 7223 to 7383
   goals met: 12 of 17
39. (disembark-truck driver3 truck1 s1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 13 of 17
40. (walk driver3 s1 p2-1)
   deleted: (at driver3 s1)
   added: (at driver3 p2-1)
   goals met: 12 of 17
41. (unload-truck package5 truck3 s1)
   deleted: (in package5 truck3)
   added: (at package5 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 13 of 17
42. (drive-truck truck2 s0 s2 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 7383 to 8333
   goals met: 12 of 17
43. (disembark-truck driver2 truck2 s2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 13 of 17
44. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 12 of 17
45. (walk driver3 p2-1 s2)
   deleted: (at driver3 p2-1)
   added: (at driver3 s2)
   goals met: 12 of 17
46. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 13 of 17
47. (walk driver1 s0 p0-1)
   deleted: (at driver1 s0)
   added: (at driver1 p0-1)
   goals met: 12 of 17
48. (walk driver1 p0-1 s1)
   deleted: (at driver1 p0-1)
   added: (at driver1 s1)
   goals met: 12 of 17
49. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   goals met: 12 of 17
50. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   goals met: 13 of 17
51. (board-truck driver3 truck1 s1)
   deleted: (at driver3 s1) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 12 of 17
52. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 8333 to 8933
   goals met: 13 of 17
53. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 12 of 17
54. (drive-truck truck2 s2 s0 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 8933 to 9883
   goals met: 13 of 17
55. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 9883 to 10833
   goals met: 12 of 17
56. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 12 of 17
57. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   goals met: 12 of 17
58. (drive-truck truck2 s0 s2 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 10833 to 11783
   goals met: 11 of 17
59. (disembark-truck driver2 truck2 s2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s2) (empty truck2)
   goals met: 12 of 17
60. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 11 of 17
61. (walk driver3 p2-1 s2)
   deleted: (at driver3 p2-1)
   added: (at driver3 s2)
   goals met: 11 of 17
62. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 11 of 17
63. (drive-truck truck2 s2 s1 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 11783 to 11943
   goals met: 11 of 17
64. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 12 of 17
65. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 11 of 17
66. (drive-truck truck1 s2 s0 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 11943 to 12893
   goals met: 12 of 17
67. (walk driver1 s1 p2-1)
   deleted: (at driver1 s1)
   added: (at driver1 p2-1)
   goals met: 12 of 17
68. (disembark-truck driver2 truck1 s0)
   deleted: (driving driver2 truck1)
   added: (at driver2 s0) (empty truck1)
   goals met: 12 of 17
69. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   goals met: 12 of 17
70. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   goals met: 13 of 17
71. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 12893 to 13493
   goals met: 14 of 17
72. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 13 of 17
73. (drive-truck truck4 s2 s0 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (fuel-used) from 13493 to 14443
   goals met: 14 of 17
74. (disembark-truck driver3 truck2 s0)
   deleted: (driving driver3 truck2)
   added: (at driver3 s0) (empty truck2)
   goals met: 14 of 17
75. (walk driver3 s0 p0-1)
   deleted: (at driver3 s0)
   added: (at driver3 p0-1)
   goals met: 14 of 17
76. (drive-truck truck4 s0 s2 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (fuel-used) from 14443 to 15393
   goals met: 13 of 17
77. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 14 of 17
78. (walk driver1 p2-1 s2)
   deleted: (at driver1 p2-1)
   added: (at driver1 s2)
   goals met: 14 of 17
79. (board-truck driver1 truck4 s2)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 14 of 17
80. (walk driver3 p0-1 s1)
   deleted: (at driver3 p0-1)
   added: (at driver3 s1)
   goals met: 15 of 17
81. (drive-truck truck4 s2 s0 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (fuel-used) from 15393 to 16343
   goals met: 16 of 17
82. (disembark-truck driver1 truck4 s0)
   deleted: (driving driver1 truck4)
   added: (at driver1 s0) (empty truck4)
   goals met: 17 of 17
